{
  "header": {
    "projects": "Projects",
    "aboutMe": "About",
    "contactMe": "Contact",
    "resume": "Resume"
  },

  "landing": {
    "greeting": "Hello, I am Thomas!",
    "bio1": "A Full Stack Developer",
    "bio2": "Bridging the Frontend & Backend with React & Node.js",
    "btnText": "Get in touch"
  },

  "alert": {
    "successHeader": "All good!",
    "errorHeader": "Oops!"
  },

  "contactMe": {
    "heading": "Contact me",
    "required": "*",
    "optional": "(Optional)",
    "labels": {
      "name": "Your Name",
      "email": "Your Email",
      "type": "Type of inquiry",
      "message": "Your Message"
    },
    "placeholders": {
      "select": "-- Select --",
      "hireMe": "Freelance project proposal",
      "feedback": "Feedback",
      "other": "Other"
    },
    "buttons": {
      "send": "Send"
    },
    "alerts": {
      "success": "Thanks for your submission {{name}}, I will get back to you shortly!",
      "error": "Something went wrong, please try again later!"
    },
    "validation": {
      "requiredName": "Name is required",
      "invalidEmail": "Invalid email address",
      "requiredEmail": "Email is required",
      "requiredComment": "Message is required",
      "minComment": "Message must be at least 25 characters long"
    }
  },

  "aboutMe": {
    "heading": "About Me",
    "paragraph1-phase1": "As a passionate Web Developer and Open Source Contributor, I have dedicated my journey to honing skills in React, Node.js, and modern web development frameworks. My contributions to open source projects, such as",
    "paragraph1-phase2": "have strengthened both my technical expertise and my understanding of building user-centric, scalable solutions.",
    "paragraph2": "I specialize in managing feature development, refining UI/UX interactions, and writing clear, reusable code that enhances project functionality and accessibility. My work bridges technical depth with practical application, ensuring complex features are intuitive for users and maintainable for teams.",
    "paragraph3": "This combination of hands-on coding and teamwork empowers me to effectively collaborate, communicate, and contribute to impactful web solutions that resonate with both technical and non-technical stakeholders."
  },

  "techStack": {
    "techStackTitle": "Tech Stack",
    "techStackSubtitle": "Here are some of the technologies I have experience with:",
    "frontend": "Frontend",
    "backend": "Backend",
    "tools": "Tools"
  },

  "projects": {
    "heading": "Featured Projects",
    "sawyerCamp": {
      "title": "Sawyer-Camp Farmers CIG",
      "description": "Developed and launched a website for Sawyer Camp Farmers Common Initiative Group, empowering local farmers in Cameroon by showcasing their products and sustainable farming practices. Implemented user-friendly design and seamless navigation to enhance user experience and engagement."
    },
    "resumeBuilder": {
      "title": "AI Resume Builder",
      "description": "An innovative AI-powered resume builder, provides a secure platform for users to log in, update their profiles, and create professional resumes. With the option to choose from existing templates or generate a personalized one using advanced AI algorithms, ResumeCraft ensures that resumes are tailored to each user's unique profile."
    },
    "bookMart": {
      "title": "BookMart",
      "description": "A secure and user-friendly book management application that allows users to log in securely and perform essential CRUD (Create, Read, Update, Delete) operations on their book inventory. With an intuitive interface, users can easily add new books, update existing entries, and remove items they no longer need."
    },
    "beautySpa": {
      "title": "Annette's Beauty & SPA",
      "description": "Transformed Annette's online presence with a user-friendly website. Clients can explore a curated gallery of styles and services, effortlessly book appointments, and discover Annette's offerings. Pamper loved ones with secure gift card purchases (powered by Stripe). This comprehensive platform enhances the overall customer experience."
    }
  },

  "card": {
    "githubTooltip": "GitHub Repo",
    "websiteTooltip": "Website",
    "isExpanded": "Show less",
    "isCollapsed": "Read more"
  },

  "consent": {
    "message": "This website uses cookies to collect data for analytics purposes to help improve your experience.",
    "span": "By clicking 'Accept' or by continuing to use this site (including scrolling), you consent to the use of these cookies.",
    "policyButtonText": "Learn more in my Privacy Policy.",
    "accept": "Accept",
    "decline": "Decline",
    "manage": "Cookie Preferences"
  },

  "policy": {
    "title": "Privacy Policy",
    "text1": "This website uses Google Analytics to collect anonymized website traffic data, including page views, browser types, and user interactions. The data helps improve website design, usability, and user experience.",
    "text11": "Google Analytics tracking is enabled only if you accept cookies. If you decline cookies, no tracking occurs, and no data is collected by Google Analytics during your visit.",
    "text2": "Google Analytics may collect your approximate geographic location and anonymized IP address. No personally identifiable information (PII) is collected or stored.",
    "text3": "For more details, please refer to",
    "linkText": "Google's Privacy Policy.",
    "modalCloseButton": "Close"
  },

  "manageCookie": {
    "title": "Cookie Preferences",
    "message": {
      "hadAccepted": "You have accepted cookies. Cookies are used for analytics to improve your experience.",
      "hadDeclined": "You have declined cookies. Cookies are used for analytics to improve your experience.",
      "cookieDescription": "Cookies are small pieces of data stored on your device to help analyze site usage and improve functionality.",
      "updatePreference": "Would you like to update your cookie preferences?"
    },
    "accept": "Accept Cookies",
    "decline": "Decline Cookies",
    "keepCurrent": "Keep Current Preference"
  }
}
