{
  "header": {
    "home": "Home",
    "projects": "Projects",
    "aboutMe": "About",
    "contactMe": "Contact",
    "resume": "Resume"
  },

  "landing": {
    "greeting": "Hello, I am Thomas!",
    "bio1": "A Full Stack Developer",
    "bio2": "Bridging the Frontend & Backend with React & Node.js",
    "btnText": "Get in touch"
  },

  "alert": {
    "successHeader": "All good!",
    "errorHeader": "Oops!"
  },

  "contactMe": {
    "heading": "Contact me",
    "required": "*",
    "optional": "(Optional)",
    "labels": {
      "name": "Your Name",
      "email": "Your Email",
      "type": "Type of inquiry",
      "message": "Your Message"
    },
    "placeholders": {
      "select": "-- Select --",
      "hireMe": "Freelance project proposal",
      "feedback": "Feedback",
      "other": "Other"
    },
    "buttons": {
      "send": "Send"
    },
    "alerts": {
      "success": "Thanks for your submission {{name}}, I will get back to you shortly!",
      "error": "Something went wrong, please try again later!"
    },
    "validation": {
      "requiredName": "Name is required.",
      "minName": "Name must be at least 2 characters.",
      "maxName": "Name cannot exceed 100 characters.",
      "invalidName": "Name can only contain letters, spaces, apostrophes, and hyphens.",

      "requiredEmail": "Email is required.",
      "invalidEmail": "Enter a valid email address.",

      "invalidType": "Invalid inquiry type.",

      "requiredComment": "Message is required.",
      "minComment": "Message must be at least 25 characters.",
      "maxComment": "Message cannot exceed 1000 characters.",
      "invalidCharacters": "Message contains invalid characters.",
      "serverError": "Internal server error. Please try again later.",
      "networkError": "Network error. Please check your internet connection.",
      "timeoutError": "Request timed out. Please try again later."
    }
  },

  "aboutMe": {
    "heading": "About Me",
    "paragraph1-phase1": "As a passionate Web Developer and Open Source Contributor, I have dedicated my journey to honing skills in React, Node.js, and modern web development frameworks. My contributions to open source projects, such as",
    "paragraph1-phase2": "have strengthened both my technical expertise and my understanding of building user-centric, scalable solutions.",
    "paragraph2": "I specialize in managing feature development, refining UI/UX interactions, and writing clear, reusable code that enhances project functionality and accessibility. My work bridges technical depth with practical application, ensuring complex features are intuitive for users and maintainable for teams.",
    "paragraph3": "This combination of hands-on coding and teamwork empowers me to effectively collaborate, communicate, and contribute to impactful web solutions that resonate with both technical and non-technical stakeholders."
  },

  "techStack": {
    "techStackTitle": "Tech Stack",
    "techStackSubtitle": "Here are some of the technologies I have experience with:",
    "frontend": "Frontend",
    "backend": "Backend",
    "tools": "Tools"
  },

  "projects": {
    "heading": "Featured Projects",
    "sawyerCamp": {
      "title": "Sawyer-Camp Farmers CIG",
      "description": "Developed and launched a website for Sawyer Camp Farmers Common Initiative Group, empowering local farmers in Cameroon by showcasing their products and sustainable farming practices. Implemented user-friendly design and seamless navigation to enhance user experience and engagement."
    },
    "resumeBuilder": {
      "title": "AI Resume Builder",
      "description": "An innovative AI-powered resume builder, provides a secure platform for users to log in, update their profiles, and create professional resumes. With the option to choose from existing templates or generate a personalized one using advanced AI algorithms, ResumeCraft ensures that resumes are tailored to each user's unique profile."
    },
    "bookMart": {
      "title": "BookMart",
      "description": "A secure and user-friendly book management application that allows users to log in securely and perform essential CRUD (Create, Read, Update, Delete) operations on their book inventory. With an intuitive interface, users can easily add new books, update existing entries, and remove items they no longer need."
    },
    "beautySpa": {
      "title": "Annette's Beauty & SPA",
      "description": "Transformed Annette's online presence with a user-friendly website. Clients can explore a curated gallery of styles and services, effortlessly book appointments, and discover Annette's offerings. Pamper loved ones with secure gift card purchases (powered by Stripe). This comprehensive platform enhances the overall customer experience."
    }
  },

  "card": {
    "githubTooltip": "GitHub Repo",
    "websiteTooltip": "Website",
    "isExpanded": "Show less",
    "isCollapsed": "Read more"
  },

  "error": {
    "title": "Page Not Found",
    "text": "Sorry, the page you are looking for does not exist.",
    "btnText": "Go back home"
  },

  "consent": {
    "message": "This site uses cookies to analyze visitor interactions and improve user experience.",
    "span": "By clicking 'Accept', you consent to their use.",
    "policyButtonText": "Learn more in my Privacy Policy.",
    "accept": "Accept",
    "decline": "Decline",
    "manage": "Cookie Preferences"
  },

  "privacyPolicy": {
    "title": "Privacy Policy",
    "effectiveDate": "Effective Date: January 31, 2025",
    "introduction": {
      "title": "Introduction",
      "text": "This Privacy Policy describes how I collect, use, and disclose your information when you use this website."
    },
    "informationCollected": {
      "title": "Information I Collect",
      "description": "I use Google Analytics to collect anonymized data about website traffic.",
      "descriptionText": "Google Analytics tracking is enabled **only if you accept cookies**. If accepted, it uses cookies (small data files placed on your device) to track and analyze visitor activity. The data collected may include:",
      "list": [
        "Device Information (browser type, operating system, device category)",
        "Approximate geographic location (country, region, and city level **only**)",
        "Website Interactions (pages visited, time spent, clicks, scrolling behavior)",
        "Traffic Sources (referral links, search engines, direct visits)"
      ],
      "usage": "This data helps me analyze visitor interactions, improve website performance, and enhance user experience across different devices.",
      "identifiableInfo": "**No personally identifiable information (PII) is collected or stored**. Your IP address is anonymized, and data is retained for a limited period."
    },
    "cookies": {
      "title": "Cookies",
      "description": "This website uses cookies to store your preferences and enhance your browsing experience. Specifically:",
      "list": [
        "**Google Analytics Cookies:** Used to track anonymized visitor activity.",
        "**LocalStorage Data:** Used to store user preferences such as dark/light mode and language selection."
      ],
      "disableNotice": "You can manage or disable cookies via your web browser settings. However, doing so means I won’t be able to analyze website traffic, which helps me understand how visitors engage with the site and improve its content.",
      "retention": "Your cookie consent choice is retained for **90 days**. After this period, you will be prompted to review your preferences again."
    },
    "contactForm": {
      "title": "Contact Form",
      "description": "When you submit a message via the contact form, the following information is collected:",
      "list": [
        "Your Name (to personalize responses)",
        "Your Email Address (to reply to your message and send confirmation)",
        "Type of Inquiry (to categorize and prioritize messages)",
        "Your Message Content (to address your inquiry)"
      ],
      "storage": "Your message is stored securely in a MongoDB database and a confirmation email is sent to your provided email via Nodemailer.",
      "retention": "Your message is retained for 6 months to ensure follow-ups can be processed. You may request deletion at any time."
    },
    "yourChoices": {
      "title": "Your Choices",
      "description": "You can opt out of Google Analytics tracking by installing the official Google Analytics Opt-out Browser Add-on:",
      "optOutLink": "Google Analytics Opt-out Add-on"
    },
    "dataRetention": {
      "title": "Data Retention",
      "description": [
        "Data collected by Google Analytics is retained for **14 months** for both user data and event data. If you interact with the website within this period, the retention timer resets.",
        "Contact form messages are retained for **6 months** to ensure follow-ups can be processed. You may request deletion of your submitted data at any time by contacting me."
      ]
    },
    "dataSecurity": {
      "title": "Data Security",
      "description": "I take reasonable steps to protect data collected through this website from unauthorized access, alteration, or destruction. However, no website or internet transmission is completely secure."
    },
    "policyChanges": {
      "title": "Changes to This Privacy Policy",
      "description": "This Privacy Policy may be updated periodically. Any changes will be posted on this page, and the effective date will be updated accordingly."
    },
    "contact": {
      "title": "Contact",
      "description": "If you have any questions about this Privacy Policy, feel free to reach out:",
      "email": "email@thomastepi.com"
    },
    "additionalInfo": {
      "title": "Additional Information",
      "description": "For more details about how Google Analytics collects and processes data, refer to:",
      "privacyLink": "Google’s Privacy Policy"
    },
    "lastUpdated": "Last Updated: January 31, 2025"
  }
}
